poiuy105/3nmos_no_wifi/sdkconfig.defaults
# ESP32-S3 目标芯片
CONFIG_IDF_TARGET="esp32s3"

# 控制台日志：UART0 (TX=GPIO43, RX=GPIO44)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_TX_GPIO=43
CONFIG_ESP_CONSOLE_UART_RX_GPIO=44

# WiFi（仅 AP 模式，用于本地配置页面）+ PHY
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_PHY_ENABLED=y
CONFIG_WPA_MBEDTLS_CRYPTO=y

# HTTP Server（配置页面）
CONFIG_ESP_HTTP_SERVER_ENABLE=y

# NVS Flash
CONFIG_NVS_FLASH_ENCRYPTION=n

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 分区表（单 app）
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# 编译优化（减小体积）
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
